testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_1000000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/1/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 29.83s, 0.34 req/s, 319.75MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 9.32GB (10003052540) total, 140B (140) headers (space savings 85.57%), 9.31GB (10000000000) data
UDP datagram: 364042 sent, 8213249 received
                     min         max         mean         sd        +/- sd
time for request:     29.81s      29.83s      29.81s      7.92ms    60.00%
time for connect:     4.16ms     26.44ms     15.18ms      7.54ms    60.00%
time to 1st byte:    26.06ms     28.80ms     27.41ms      1.08ms    70.00%
req/s           :       0.03        0.03        0.03        0.00    60.00%